app/Admin/bootstrap.php

select * from `terms` where (`enterprise_id` = 7) order by `id` desc
---

        if ($u != null) {
            $check_list = Utils::system_checklist($u);
            $terms = Term::where([
                'enterprise_id' => $u->enterprise_id
            ])
                ->orderBy('id', 'desc')
                ->get();