routes/web.php

select * from `account_parents` where `account_parents`.`id` = '1' limit 1
---
Route::get('project-report', function () {

  $id = $_GET['id'];
  $project = AccountParent::find($id);