app/Admin/Controllers/AccountController.php

select * from `enterprises` where `enterprises`.`id` = 7 limit 1
---



        $ent = Enterprise::find(Admin::user()->enterprise_id);

select * from `enterprises` where `enterprises`.`id` = 7 limit 1
---
    protected function form()
    {
        $form = new Form(new Account());

        $payable = 0;
        $paid = 0;
        $balance = 0;
        $id = 0;



        $account_parent_id = null;
        if (isset($_GET['account_parent_id'])) {
            $account_parent_id = $_GET['account_parent_id'];
        }

        $u = Admin::user();
        $ent = Enterprise::find($u->enterprise_id);