app/Admin/Controllers/AccountParentController.php

            return '<span class="p-1 text-white" style="font-wight: 800!important; background-color: ' . $color . ';">UGX ' . number_format($bal) . '</span>';
        });

        $grid->column('Accounts', __('Accounts'))->display(function () {
            return count($this->accounts);
        });
---
select * from `accounts` where `accounts`.`account_parent_id` = 1 and `accounts`.`account_parent_id` is not null