app/Admin/Controllers/BulkMessageController.php

    protected function grid()
    {
        $m = BulkMessage::find(6);
---
select * from `bulk_messages` where `bulk_messages`.`id` = 6 limit 1