app/Admin/Controllers/FinancialExpenditureRecordController.php

select * from `terms` where `enterprise_id` = 7 order by `id` desc
---
    protected function grid()
    {



        $grid = new Grid(new FinancialRecord());

        $grid->export(function ($export) {
            $export->filename('Financial Records');
            $export->except(['actions']);
            $export->originalValue(['description', 'type']);
        });

        $grid->disableBatchActions();
        $terms = [];
        $active_term = 0;
        foreach (
            Term::where(
                'enterprise_id',
                Admin::user()->enterprise_id
            )->orderBy('id', 'desc')->get() as $key => $term
        ) {

select * from `account_parents` where (`enterprise_id` = 7) order by `id` desc
---



            foreach (
                AccountParent::where([
                    'enterprise_id' => $u->enterprise_id
                ])
                    ->orderBy('id', 'desc')
                    ->get() as $v
            ) {

select * from `terms` where `enterprise_id` = 7 order by `id` desc
---
            $filter->equal('account_id', 'Filter by activity')
                ->select($accs);

            foreach (
                Term::where(
                    'enterprise_id',
                    Admin::user()->enterprise_id
                )->orderBy('id', 'desc')->get() as $key => $term
            ) {

select * from `accounts` where `accounts`.`id` = 10 limit 1
---
            ->hide();


        $grid->column('account_id', __('Activity'))
            ->display(function ($x) {
                if ($this->account == null) {
                    return $x;
                }
                return $this->account->name;
            })->sortable();