app/Admin/Controllers/FinancialBudgetRecordController.php

select * from `accounts`
select * from `account_parents` where (`enterprise_id` = 7) order by `id` desc
---



        $grid->filter(function ($filter) {
            // Remove the default id filter
            $filter->disableIdFilter();
            $u = Admin::user();
            $accs = [];
            foreach (
                Account::where([])
                    ->get() as $val
            ) {
                if ($val->account_parent_id == null) {
                    continue;
                }

                $accs[$val->id] = $val->getName();
            }
            $parents = [];



            foreach (
                AccountParent::where([
                    'enterprise_id' => $u->enterprise_id,
                ])
                    ->orderBy('id', 'desc')
                    ->get() as $v
            ) {

select * from `accounts` where `accounts`.`id` = 10 limit 1
---
            ->hide();


        $grid->column('account_id', __('Activity'))
            ->display(function ($x) {
                if ($this->account == null) {
                    return $x;
                }
                return $this->account->name;
            })->sortable();