app/Admin/Controllers/HomeController.php

                    $ent = $u->ent;
                    $term = $ent->active_term();

                    $transsactions_tot = Transaction::where([
                        'enterprise_id' => $ent->id,
                        'term_id' => $term->id,
                    ])
                        ->where('amount', '>', 0)
                        ->sum('amount');
---
select sum(`amount`) as aggregate from `transactions` where (`enterprise_id` = 7 and `term_id` = 52) and `amount` > 0

                        'is_dark' => true,
                        'title' => 'EXPENDITURE',
                        'sub_title' => 'Total Expenditure',
                        'number' => "<small class=\"text-white\">$</small>" . number_format(FinancialRecord::where([
                                'type' => 'EXPENDITURE',
                            ])->sum('amount')),
---
select sum(`amount`) as aggregate from `financial_records` where (`type` = 'EXPENDITURE')