app/Admin/Controllers/HomeController.php

                        return;
                    }
                    //postive transactions made this term
                    $transsactions_tot = Transaction::where([
                        'enterprise_id' => $ent->id,
                        'term_id' => $term->id,
                    ])
                        ->where('amount', '>', 0)
                        ->sum('amount');
---
select sum(`amount`) as aggregate from `transactions` where (`enterprise_id` = 7 and `term_id` = 52) and `amount` > 0

                });
                $row->column(3, function (Column $column) {
                    $term = Auth::user()->ent->dpTerm();
                    $val = StockBatch::where([
                        'enterprise_id' => $term->enterprise_id,
                        'term_id' => $term->id
                    ])->sum('worth');
---
select sum(`worth`) as aggregate from `stock_batches` where (`enterprise_id` = 7 and `term_id` = 52) and `stock_batches`.`deleted_at` is null


                $row->column(3, function (Column $column) {
                    $term = Auth::user()->ent->dpTerm();
                    $r = ReportFinanceModel::where([
                        'enterprise_id' => $term->enterprise_id,
                        'term_id' => $term->id
                    ])->first();
---
select * from `report_finances` where (`enterprise_id` = 7 and `term_id` = 52) limit 1