app/Admin/Controllers/HomeController.php

                });
                $row->column(3, function (Column $column) {
                    $term = Auth::user()->ent->dpTerm();
                    $r = ReportFinanceModel::where([
                        'enterprise_id' => $term->enterprise_id,
                        'term_id' => $term->id
                    ])->first();
---
select * from `report_finances` where (`enterprise_id` = 7 and `term_id` = 52) limit 1

                    ]));
                });

                $row->column(3, function (Column $column) {
                    $term = Auth::user()->ent->dpTerm();
                    $r = ReportFinanceModel::where([
                        'enterprise_id' => $term->enterprise_id,
                        'term_id' => $term->id
                    ])->first();
                    $val = 0;
                    if ($r) {
                        $val = ($r->total_bursaries_funds);
                    }
                    $column->append(view('widgets.box-5', [
                        'is_dark' => false,
                        'title' => 'Total Bursaries Offered',
                        'sub_title' => 'Total sum of bursaries offered this term.',
                        'number' => "<small>UGX</small>" . number_format($val),
                        'link' => admin_url('transactions')
                    ]));
                });
---
select * from `report_finances` where (`enterprise_id` = 7 and `term_id` = 52) limit 1

                        return;
                    }
                    //postive transactions made this term
                    $transsactions_tot = Transaction::where([
                        'enterprise_id' => $ent->id,
                        'term_id' => $term->id,
                    ])
                        ->where('amount', '>', 0)
                        ->sum('amount');
---
select sum(`amount`) as aggregate from `transactions` where (`enterprise_id` = 7 and `term_id` = 52) and `amount` > 0

                    ]));
                });

                $row->column(3, function (Column $column) {
                    $term = Auth::user()->ent->dpTerm();
                    $r = ReportFinanceModel::where([
                        'enterprise_id' => $term->enterprise_id,
                        'term_id' => $term->id
                    ])->first();
                    $val = 0;
                    if ($r) {
                        $val = ($r->total_budget);
                    }
                    $column->append(view('widgets.box-5', [
                        'is_dark' => false,
                        'title' => 'Total Budget',
                        'sub_title' => 'Planned to be spent this term.',
                        'number' => "<small>UGX</small>" . number_format($val),
                        'link' => admin_url('financial-records-budget')
                    ]));
                });

                $row->column(3, function (Column $column) {
                    $term = Auth::user()->ent->dpTerm();
                    $r = ReportFinanceModel::where([
                        'enterprise_id' => $term->enterprise_id,
                        'term_id' => $term->id
                    ])->first();
                    $val = 0;
                    if ($r) {
                        $val = ($r->total_expense);
                    }
                    $column->append(view('widgets.box-5', [
                        'is_dark' => false,
                        'title' => 'Total Expenditure',
                        'sub_title' => 'Total amount of money spent this term.',
                        'number' => "<small>UGX</small>" . number_format($val),
                        'link' => admin_url('financial-records-expenditure')
                    ]));
                });
                $row->column(3, function (Column $column) {
                    $term = Auth::user()->ent->dpTerm();
                    $val = StockBatch::where([
                        'enterprise_id' => $term->enterprise_id,
                        'term_id' => $term->id
                    ])->sum('worth');
                    $column->append(view('widgets.box-5', [
                        'is_dark' => false,
                        'title' => 'Stock Value',
                        'sub_title' => 'Current total stock value in stores.',
                        'number' => "<small>UGX</small>" . number_format($val),
                        'link' => admin_url('stock-batches')
                    ]));
                });


                $row->column(3, function (Column $column) {
                    $term = Auth::user()->ent->dpTerm();
                    $r = ReportFinanceModel::where([
                        'enterprise_id' => $term->enterprise_id,
                        'term_id' => $term->id
                    ])->first();
                    $column->append(view('widgets.print-financial-report', [
                        'enterprise_id' => $r->id,
                    ]));
                });
---
select * from `report_finances` where (`enterprise_id` = 7 and `term_id` = 52) limit 1
select sum(`worth`) as aggregate from `stock_batches` where (`enterprise_id` = 7 and `term_id` = 52) and `stock_batches`.`deleted_at` is null