app/Admin/Controllers/PostController.php

            ->sortable();
        $grid->column('academic_year_id', __('Academic Year'))
            ->display(function ($year) {
                return \App\Models\AcademicYear::find($year)->name;
---
select * from `academic_years` where `academic_years`.`id` = 18 limit 1

            ->hide();
        $grid->column('term_id', __('Term'))
            ->display(function ($term) {
                return "Term " . \App\Models\Term::find($term)->name;
---
select * from `terms` where `terms`.`id` = 52 limit 1

        $grid->column('description', __('Description'))->hide();
        $grid->column('view_count', __('Views'))
            ->display(function ($views) {
                return $this->views()->count();
---
select count(*) as aggregate from `post_views` where `post_views`.`post_id` = 6 and `post_views`.`post_id` is not null

    protected function form()
    {
        $form = new Form(new Post());
        $u = Admin::user();
        $segment = request()->segment(1);
        $type = 'News';
        if ($segment == 'notice-board') {
            $type = 'Notice';
        } else if ($segment == 'events') {
            $type = 'Event';
        }
        $ent = \App\Models\Enterprise::find($u->enterprise_id);
---
select * from `enterprises` where `enterprises`.`id` = 7 limit 1