app/Http/Controllers/ApiMainController.php

select * from `enterprises` where `enterprises`.`id` = 7 limit 1
---
    public function manifest()
    {
        $query = auth('api')->user();
        if ($query == null) {
            return $this->error('User not found.');
        }
        $admin = Administrator::find($query->id);
        if ($admin == null) {
            return $this->error('User not found.');
        }
        $admin->last_seen = Carbon::now();
        $admin->save();
        $ent = Enterprise::find($admin->enterprise_id);