app/Models/Account.php

select sum(`amount`) as aggregate from `financial_records` where (`account_id` = 1 and `type` = 'BUDGET')
---
    public function getBudget($term = null)
    {
        return FinancialRecord::where([
            'account_id' => $this->id,
            'type' => 'BUDGET',
        ])->sum('amount');

select sum(`amount`) as aggregate from `financial_records` where (`account_id` = 1 and `type` = 'EXPENDITURE')
---
    public function getExpenditure()
    {
        return FinancialRecord::where([
            'account_id' => $this->id,
            'type' => 'EXPENDITURE',
        ])->sum('amount');

select * from `account_parents` where `account_parents`.`id` = 1 limit 1
---
    public function getName()
    {
        if ($this->account_parent_id == null) {
            return $this->name;
        }
        $par = AccountParent::find($this->account_parent_id);

select sum(`amount`) as aggregate from `transactions` where (`account_id` = 1 and `is_contra_entry` = 0 and `academic_year_id` = 18) and `amount` > 0
---
    public function getDebitAttribute()
    {
        $academic_year_id = 0;
        $u = Admin::user();
        if ($u != null) {
            if ($u->ent != null) {
                $year = $u->ent->dpYear();
                if ($year != null) {
                    $academic_year_id = $year->id;
                }
            }
        }

        return Transaction::where([
            'account_id' => $this->id,
            'is_contra_entry' => 0,
            'academic_year_id' => $academic_year_id
        ])
            ->where('amount', '>', 0)
            ->sum('amount');

select sum(`amount`) as aggregate from `transactions` where (`account_id` = 1 and `is_contra_entry` = 0 and `academic_year_id` = 18) and `amount` < 0
---
    public function getCreditAttribute()
    {
        $academic_year_id = 0;
        $u = Admin::user();
        if ($u != null) {
            if ($u->ent != null) {
                $year = $u->ent->dpYear();
                if ($year != null) {
                    $academic_year_id = $year->id;
                }
            }
        }

        return Transaction::where([
            'account_id' => $this->id,
            'is_contra_entry' => 0,
            'academic_year_id' => $academic_year_id
        ])
            ->where('amount', '<', 0)
            ->sum('amount');