app/Models/AccountParent.php

    public function getBudget($term = null)
    {
        return FinancialRecord::where([
            'parent_account_id' => $this->id,
            'type' => 'BUDGET',
        ])->sum('amount');
---
select sum(`amount`) as aggregate from `financial_records` where (`parent_account_id` = 1 and `type` = 'BUDGET')

    public function getExpenditure($term = null)
    {
        return FinancialRecord::where([
            'parent_account_id' => $this->id,
            'type' => 'EXPENDITURE',
        ])->sum('amount');
---
select sum(`amount`) as aggregate from `financial_records` where (`parent_account_id` = 1 and `type` = 'EXPENDITURE')

    public function getBalance($year = null)
    {
        $exp = FinancialRecord::where([
            'parent_account_id' => $this->id,
            'type' => 'EXPENDITURE',
        ])->sum('amount');
        $bud = FinancialRecord::where([
            'parent_account_id' => $this->id,
            'type' => 'BUDGET',
        ])->sum('amount');
---
select sum(`amount`) as aggregate from `financial_records` where (`parent_account_id` = 1 and `type` = 'EXPENDITURE')
select * from `accounts` where (`account_parent_id` = 1)
select sum(`amount`) as aggregate from `financial_records` where (`parent_account_id` = 1 and `type` = 'BUDGET')

    public function getSum($year)
    {

        $tot = 0;
        // $accs = "SELECT id FROM accounts WHERE account_parent_id = $this->id";
        // $sums = "SELECT id FROM accounts WHERE account_parent_id = $this->id";

        foreach (
            Account::where([
                'account_parent_id' => $this->id
            ])->get() as $key => $acc
        ) {
            $tot += Transaction::where([
                'account_id' => $acc->id,
                /* 'is_contra_entry' => 0, */
                'academic_year_id' => $year->id
            ])
                ->where('amount', '<', 0)
                ->sum('amount');
---
select sum(`amount`) as aggregate from `transactions` where (`account_id` = 1)