app/Models/Account.php

    public function getBudget($term)
    {
        return FinancialRecord::where([
            'term_id' => $term->id,
            'account_id' => $this->id,
            'type' => 'BUDGET',
        ])->sum('amount');
---
select sum(`amount`) as aggregate from `financial_records` where (`term_id` = 52 and `account_id` = 1 and `type` = 'BUDGET')

    public function getExpenditure($term)
    {
        return FinancialRecord::where([
            'term_id' => $term->id,
            'account_id' => $this->id,
            'type' => 'EXPENDITURE',
        ])->sum('amount');
---
select sum(`amount`) as aggregate from `financial_records` where (`term_id` = 52 and `account_id` = 2 and `type` = 'EXPENDITURE')

    public static function create($administrator_id)
    {
        return;
        $admin = Administrator::where([
            'id' => $administrator_id
        ])->first();
        if ($admin == null) {
            throw ("Account was not created because admin account was not found.");
        }
        $acc = Account::where(['administrator_id' => $administrator_id])->first();
---
select * from `accounts` where (`administrator_id` = 4260) limit 1

    public function getDebitAttribute()
    {
        $academic_year_id = 0;
        $u = Admin::user();
        if ($u != null) {
            if ($u->ent != null) {
                $year = $u->ent->dpYear();
                if ($year != null) {
                    $academic_year_id = $year->id;
                }
            }
        }

        return Transaction::where([
            'account_id' => $this->id,
            'is_contra_entry' => 0,
            'academic_year_id' => $academic_year_id
        ])
            ->where('amount', '>', 0)
            ->sum('amount');
---
select sum(`amount`) as aggregate from `transactions` where (`account_id` = 8633 and `is_contra_entry` = 0 and `academic_year_id` = 18) and `amount` > 0

    public function getCreditAttribute()
    {
        $academic_year_id = 0;
        $u = Admin::user();
        if ($u != null) {
            if ($u->ent != null) {
                $year = $u->ent->dpYear();
                if ($year != null) {
                    $academic_year_id = $year->id;
                }
            }
        }

        return Transaction::where([
            'account_id' => $this->id,
            'is_contra_entry' => 0,
            'academic_year_id' => $academic_year_id
        ])
            ->where('amount', '<', 0)
            ->sum('amount');
---
select sum(`amount`) as aggregate from `transactions` where (`account_id` = 8633 and `is_contra_entry` = 0 and `academic_year_id` = 18) and `amount` < 0