app/Models/Enterprise.php

    public function active_term()
    {
        $t = Term::where([
            'enterprise_id' => $this->id,
            'is_active' => 1,
        ])->orderBy('id', 'desc')->first();
---
select * from `terms` where (`enterprise_id` = 7 and `is_active` = 1) order by `id` desc limit 1

    public function active_academic_year()
    {
        $t = AcademicYear::where([
            'enterprise_id' => $this->id,
            'is_active' => 1,
        ])->first();
---
select * from `academic_years` where (`enterprise_id` = 7 and `is_active` = 1) limit 1

    public function dpTerm()
    {

        $dt = Term::where([
            'enterprise_id' => $this->id,
            'id' => $this->dp_term_id,
        ])->first();
---
select * from `terms` where (`enterprise_id` = 7 and `id` = 52) limit 1