app/Models/FinancialRecord.php

    public static function boot()
    {
        parent::boot();
        self::creating(function ($m) {

            if (
                $m->type != 'BUDGET'
            ) {
                if ($m->type != 'EXPENDITURE') {
                    throw new Exception("Type not found.", 1);
                }
            }

            $m->academic_year_id = 1;
            $m->term_id = 1;
            $acc = Account::find($m->account_id);
            if ($acc == null) {
                throw new Exception("Account  not found.", 1);
            }
            $m->parent_account_id = $acc->account_parent_id;

            $m->amount = $m->quantity * $m->unit_price;

            if ($m->type == 'EXPENDITURE') {
---
select * from `terms` where `terms`.`id` = '52' limit 1
select * from `accounts` where `accounts`.`id` = '2' limit 1


            $m->academic_year_id = 1;
            $m->term_id = 1;
            $acc = Account::find($m->account_id);
---
select * from `accounts` where `accounts`.`id` = '10' limit 1