app/Models/Utils.php

    public static function process_pending_subscriptions($u)
    {
        if ($u == null) {
            return;
        }
        $subs = ServiceSubscription::where([
            'is_processed' => 'No',
            'enterprise_id' => $u->enterprise_id
        ])
            ->orderBy('id', 'desc')
            ->get();
---
select * from `service_subscriptions` where (`is_processed` = 'No' and `enterprise_id` = 7) order by `id` desc

    public static function copy_default_grading($u)
    {
        if ($u == null) {
            return;
        }
        $x = GradingScale::where([
            'enterprise_id' => $u->enterprise_id
        ])->first();
---
select * from `grading_scales` where (`enterprise_id` = 7) limit 1

    public static function system_boot($u)
    {
        if ($u == null) {
            return;
        }
        Utils::generate_termly_report_cards($u);
        self::copy_default_grading($u);
        self::process_pending_subscriptions($u);

        if ($u->enterprise_id == 1) {
            return;
        }

        foreach (Term::all() as $key => $term) {
            $r = ReportFinanceModel::where([
                'term_id' => $term->id
            ])->first();
---
select * from `terms`
select * from `report_finances` where (`term_id` = 1) limit 1

    public static function create_documents($u)
    {
        if ($u == null) {
            return;
        }
        $admission_letter = Document::where([
            'enterprise_id' => $u->enterprise_id,
            'name' => DOCUMENT_ADMISSION
        ])->first();
---
select * from `documents` where (`enterprise_id` = 7 and `name` = 'Admission letter') limit 1

    public static function classes_checklist($u)
    {

        $items = [];
        $classes = AcademicClass::where([
            'enterprise_id' => $u->enterprise_id,
        ])->get();


        foreach ($classes as $key => $class) {
            $compulsory_subjects = Subject::where([
                'academic_class_id' => $class->id

            ])
                ->where('is_optional', '!=', 1)
                ->count();

            $optional_subjects = Subject::where([
                'academic_class_id' => $class->id,
                'is_optional' => 1,
            ])->count();
---
select * from `academic_classes` where (`enterprise_id` = 7)
select count(*) as aggregate from `subjects` where (`academic_class_id` = 8 and `is_optional` = 1)

    public static function ent()
    {



        $ent_id  = 0;
        $u = Auth::user();

        if ($u != null) {
            $ent_id = ((int)($u->enterprise_id));
        }
        $ent = Enterprise::find($ent_id);
---
select * from `enterprises` where `enterprises`.`id` = 7 limit 1